---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SteelElemProfileType
source: html/c7b3662c-04bc-c9a4-91ed-e603b3511339.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SteelElemProfileType Property

"Profile Type"

## Syntax (C#)
```csharp
public static ForgeTypeId SteelElemProfileType { get; }
```